---
kind: method
id: M:Autodesk.Revit.DB.FailureMessage.GetDefaultResolutionCaption
source: html/286be575-355e-e354-4629-b1d2be0b79a7.htm
---
# Autodesk.Revit.DB.FailureMessage.GetDefaultResolutionCaption Method

Retrieves the caption of the default resolution of the failure.

## Syntax (C#)
```csharp
public string GetDefaultResolutionCaption()
```

## Returns
The caption of the default resolution of the failure.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This FailureMessage does not have any resolutions.